[{"timing_code": "T1", "timing_event": "De novo Cancer Diagnosis", "description": "The initial diagnosis of cancer in a patient, indicating the presence of malignant cells."}, {"timing_code": "T2", "timing_event": "Time from T1 to Pathology", "description": "The duration between the de novo cancer diagnosis (T1) and obtaining pathology results from tissue samples, confirming the cancer type and stage."}, {"timing_code": "T3", "timing_event": "Time from T1 to Biopsy", "description": "The interval between the de novo cancer diagnosis (T1) and the performance of a biopsy procedure to obtain tissue samples for diagnostic evaluation."}, {"timing_code": "T4", "timing_event": "Time from T1 to Cancer Screening", "description": "The period between the de novo cancer diagnosis (T1) and subsequent screening tests or imaging studies to evaluate cancer progression or recurrence."}, {"timing_code": "T5", "timing_event": "Time from T1 to Genomic Assay", "description": "The time elapsed between the de novo cancer diagnosis (T1) and conducting genomic assays or molecular testing to assess genetic alterations or biomarkers associated with the cancer."}, {"timing_code": "T6", "timing_event": "Time from T1 to Oncology Referral", "description": "The duration between the de novo cancer diagnosis (T1) and referral to an oncology specialist for further evaluation and treatment planning."}, {"timing_code": "T7", "timing_event": "Time from T1 to Care Plan", "description": "The period between the de novo cancer diagnosis (T1) and the development of a comprehensive care plan outlining the recommended treatment approach."}, {"timing_code": "T8", "timing_event": "Time from T1 to First Line Modality Treatment", "description": "The interval between the de novo cancer diagnosis (T1) and the initiation of the primary treatment modality, such as surgery, chemotherapy, or radiation therapy."}, {"timing_code": "T9", "timing_event": "Time from T1 to First Therapeutic Response", "description": "The time elapsed between the de novo cancer diagnosis (T1) and the initial therapeutic response, indicated by tumor shrinkage or reduction in malignancy."}, {"timing_code": "T10", "timing_event": "Time from T1 to Second Modality Treatment", "description": "The duration between the de novo cancer diagnosis (T1) and the initiation of additional treatment modalities, such as adjuvant therapy or targeted therapy, following the first-line treatment."}, {"timing_code": "T11", "timing_event": "Time from T1 to First Therapeutic Switch", "description": "The interval between the de novo cancer diagnosis (T1) and the decision to switch treatment modalities due to non-response or disease progression."}, {"timing_code": "T12", "timing_event": "Time from T1 to Remission", "description": "The period between the de novo cancer diagnosis (T1) and achieving remission, defined as the absence of detectable cancer cells for at least three months."}, {"timing_code": "T13", "timing_event": "Time from T1 to Cure", "description": "The duration between the de novo cancer diagnosis (T1) and achieving a state of cure, characterized by being cancer-free or having no evidence of cancer."}, {"timing_code": "T14", "timing_event": "Time from T1 to Death", "description": "The interval between the de novo cancer diagnosis (T1) and the occurrence of mortality, indicating the end of the patient's life due to cancer-related causes."}, {"timing_code": "T15", "timing_event": "Time from T1 to Palliation / Hospice", "description": "The time elapsed between the de novo cancer diagnosis (T1) and transitioning to palliative care or hospice services for end-of-life management."}, {"timing_code": "T16", "timing_event": "Time from T1 to Active Surveillance / Maintenance", "description": "The period between the de novo cancer diagnosis (T1) and the initiation of active surveillance or maintenance therapy to monitor disease progression and prevent recurrence."}, {"timing_code": "T17", "timing_event": "Time from T1 to Neo - Adjuvant Treatment", "description": "The duration between the de novo cancer diagnosis (T1) and the administration of neoadjuvant or adjuvant therapy before or after primary treatment to improve outcomes."}, {"timing_code": "T18", "timing_event": "Time from T1 to Adjuvant Treatment", "description": "The interval between the de novo cancer diagnosis (T1) and the initiation of adjuvant therapy following primary treatment to eradicate residual disease and reduce the risk of recurrence."}, {"timing_code": "T19", "timing_event": "Time from T1 to Inpatient Hospitalization", "description": "The time elapsed between the de novo cancer diagnosis (T1) and hospital admission for inpatient care, such as surgery, chemotherapy, or complications management."}, {"timing_code": "T20", "timing_event": "Time from T1 to ED / Urgent Care Event", "description": "The period between the de novo cancer diagnosis (T1) and seeking emergency department or urgent care services for acute medical issues related to cancer or its treatment."}]